---
{"dg-publish":true,"permalink":"/prosto-zadachi/guess-the-animal/"}
---

Это ещё одна #задача с [[Сайты/usaco.guide\|usaco.guide]].  Это задача из главы [*Complete Search*](https://usaco.guide/bronze/intro-complete), хоть этой задачи явно нельзя дать категорию, я бы дал *Декомпозиция*, по традиции [[МИРЭА\|МИРЭА]], но *Complete Search* это не сюда

https://usaco.org/index.php?page=viewproblem2&cpid=893

# Условие

> Bessie и Эльза любят играть в игру "угадай животное".
> 
> Сначала Беси задумывает некоторое животное. Затем Эльза задаёт серию вопросов, чтобы угадать, какое животное задумала Беси. На каждый вопрос Беси отвечает "Да" или "Нет". Например:
> 
> `Эльза: "Животное летает?"` 
> `Беси: "Нет"` 
> `Эльза: "Ест траву"` 
> `Беси: "Да"` 
> `Эльза: "Даёт молоко?"`
> `Беси: "Да"` 
> `Эльза: "Делает му-у?"`
> `Беси: "Да"` 
> `Эльза: "Корова."` 
> `Беси: "Точно!"`
> 
> Назовём "правдоподобным множеством" множество всех всех животных, с характеристиками подходящими вопросам Эльзы. Эльза задаёт вопросы пока в "правдоподобном множестве" останется только одно животное, после чего она называет его в качестве ответа. Для каждого вопроса Эльза выбирает характеристику некоторого животного и спрашивает о ней (даже если ответ не сузит "правдоподобное множество"). Она никогда не спрашивает об одной и той же характеристике дважды.
> 
> Вам даны все животные, которых знают Беси и Эльза и их характеристики. Определите максимальное количество ответов "Да", которые может получить Эльза, прежде чем она узнает задуманное животное.
> 
> #### ФОРМАТ ВВОДА (файл guess.in):
> 
> Первая строка ввода содержит количество животных, $N$ ($2\leq N \leq 100$). Каждая из последующих $N$ строк описывает животное. Строка начинается с названия животного, затем идёт целое число $K$ ($1\leq K \leq 100$), и затем $K$ характеристик этого животного. Названия и характеристики животных это строки из маленьких латинских букв $(a \ldots z)$, длиной не более 20 символов. Никакие два животных не имеют полностью совпадающие характеристики.
> 
> #### ФОРМАТ ВЫВОДА (файл guess.out):
> 
> Выведите максимальное количество ответов "Да", которые Эльза может получить прежде чем игра закончится.
> 
> #### ПРИМЕР ВВОДА:
> 
> `4`
> `bird 2 flies eatsworms`
> `cow 4 eatsgrass isawesome makesmilk goesmoo`
> `sheep 1 eatsgrass`
> `goat 2 makesmilk eatsgrass`
> 
> #### ПРИМЕР ВЫВОДА:
> 
> `3`
> 
> В этом примере Беси может получить только 3 ответа "Да" — они приведены в тексте задачи и невозможно получить более 3 "Да".

*Автор*: Brian Dean

# Ход решений 🧠

Для начала, надо понять, что максимальное количество вопросов чтобы убрать всех животных (кроме одного), надо чтобы для двух животных этого количество должно быть достаточно.  Т.е. можно научиться решить задачу, для двух животных - понять сколько для них потребуется вопросов если брать по максимальному.  Потом в цикле для каждых 2х животных искать вопросов, и в ответе выводить максимум.

Ок.  Теперь надо научиться искать для двух животных максимальное количество вопросов.  Если подумать, то станет ясно, что вопросы перестать задавать нужно тогда, когда нужно спросить критерий (свойство), свойственное для одного, но не свойственное для другого, ведь тогда мы поймём, какое животное загадано.  

*А сколько вопросов можно задать до этого?*

**Столько, сколько общих свойств у них! (что логично).**

И если соединить два этихнаблюдения, то легко решить проблему.

Т.е. ответ 

$$\left(\max_{i, j\ \in\ 0 .. N} ( c(i, j) )\right)+1$$ где $c(i, j)$ — функция, возвращающая количество общих свойств.  Единицу надо добавить потому, что после вопросов не сужающих круг, надо сделать последний, выявивший загаданного животного

# Код

```cpp
#include <fstream>
#include <unordered_set>
#include <vector>

using namespace std;

const int maxn = 150;
unordered_set<string> props[maxn];

int count_general_props(int i, int j) {
  int cnt = 0;
  for (auto prop : props[i])
    cnt += props[j].count(prop);
  return cnt;
}

int main() {
  ifstream cin("guess.in");
  ofstream cout("guess.out");

  int n;
  cin >> n;

  for (int ani = 0; ani < n; ani++) {
    string name;
    int nprops;
    cin >> name >> nprops;
    for (int j = 0; j < nprops; j++) {
      string prop;
      cin >> prop;
      props[ani].insert(prop);
    }
  }

  int ans = -1;
  for (int i = 0; i < n; i++)
    for (int j = i + 1; j < n; j++)
      ans = max(ans, count_general_props(i, j));

  cout << (ans + 1);
}
```

